# YOLOv10_1D-cls image classification model.

# Parameters
ch: 1  # input channels
nc: 7  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10_1Dn-cls.yaml' will call yolov10_1D-cls.yaml with scale 'n'
  # [depth, width, max_channels] depth控制隐藏层重复次数，width和max_channels控制隐藏层输出通道数
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]

# activation function
activation: nn.SiLU()  # default activation

# YOLOv10_1D.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv1d, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv1d, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f1d, [128, True]]
  - [-1, 1, Conv1d, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f1d, [256, True]]
  - [-1, 1, SCDown1d, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f1d, [512, True]]
  - [-1, 1, SCDown1d, [1024, 3, 2]]  # 7-P5/32
  - [-1, 1, SENet1d, [1024]]
  - [-1, 3, C2fCIB1d, [1024, True, True]]

# YOLOv10_1D.0n head
head:
  - [-1, 1, Classify, [nc]]  # Classify
